In [1]:
import pandas as pd

In [3]:
# Ejercicio 1: Crear un DataFrame con información de personas 
#(nombre, edad, ciudad).

personas = {"Nombre":["Juan","Pedro","Tomas"],
           "Edad":[24,22,33],
           "Ciudad":["Mexico","Madrid","Buenos Aires"]}

df = pd.DataFrame(personas)

df

  Nombre  Edad        Ciudad
0   Juan    24        Mexico
1  Pedro    22        Madrid
2  Tomas    33  Buenos Aires

In [4]:
# Ejercicio 2: Mostrar las primeras 3 filas del Data

df.head(3)

  Nombre  Edad        Ciudad
0   Juan    24        Mexico
1  Pedro    22        Madrid
2  Tomas    33  Buenos Aires

In [5]:
df.tail(3)

  Nombre  Edad        Ciudad
0   Juan    24        Mexico
1  Pedro    22        Madrid
2  Tomas    33  Buenos Aires

In [6]:
# Ejercicio 3: Filtrar personas mayores de 25 años

mayores_a_25 = df[df["Edad"] > 25]

mayores_a_25

  Nombre  Edad        Ciudad
2  Tomas    33  Buenos Aires

In [17]:
# Ejercicio 4: Añadir una nueva columna 'Género' al DataFrame.

df["Genero"] = ["Masculino","Masculino","Masculino"]

df

  Nombre  Edad     Ubicacion     Genero
0   Juan    24        Mexico  Masculino
1  Pedro    22        Madrid  Masculino
2  Tomas    33  Buenos Aires  Masculino

In [18]:
# Ejercicio 5: Calcular la edad promedio de las personas en el DataFrame.

edad = df["Edad"].mean()

edad

26.333333333333332

In [19]:
# Ejercicio 6: Ordenar el DataFrame por edad de forma descendente.

edad_ordenada= df.sort_values(by = "Edad",ascending = False)

edad_ordenada

  Nombre  Edad     Ubicacion     Genero
2  Tomas    33  Buenos Aires  Masculino
0   Juan    24        Mexico  Masculino
1  Pedro    22        Madrid  Masculino

In [20]:
# Ejercicio 7: Cambiar el nombre de la columna 'Ciudad' a 'Ubicación'.


df = df.rename(columns = {"Ciudad":"Ubicacion"})

df

  Nombre  Edad     Ubicacion     Genero
0   Juan    24        Mexico  Masculino
1  Pedro    22        Madrid  Masculino
2  Tomas    33  Buenos Aires  Masculino

In [21]:
# Ejercicio 8: Eliminar la columna 'Género' del DataFrame.

df = df.drop("Genero",axis = 1)

df

  Nombre  Edad     Ubicacion
0   Juan    24        Mexico
1  Pedro    22        Madrid
2  Tomas    33  Buenos Aires

In [22]:
# Ejercicio 9: Contar la cantidad de personas en cada ciudad.

conteo_ciudades = df["Ubicacion"].value_counts()

conteo_ciudades

Mexico          1
Madrid          1
Buenos Aires    1
Name: Ubicacion, dtype: int64

In [23]:
# Ejercicio 10: Guardar el DataFrame en un archivo CSV llamado 'personas.csv'.

df.to_csv("personas.csv",index = False)